{"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 252], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_layer"}, "name": "input_layer", "inbound_nodes": []}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 0, "stop": 4, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_1", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_1", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 4, "stop": 8, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_2", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_2", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 8, "stop": 12, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_3", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_3", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 12, "stop": 16, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_4", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_4", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 16, "stop": 20, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_5", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_5", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 20, "stop": 24, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_6", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_6", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 24, "stop": 28, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_7", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_7", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 28, "stop": 32, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_8", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_8", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 32, "stop": 36, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_9", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_9", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 36, "stop": 40, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_10", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_10", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 40, "stop": 44, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_11", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_11", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 44, "stop": 48, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_12", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_12", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 48, "stop": 52, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_13", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_13", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 52, "stop": 56, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_14", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_14", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 56, "stop": 60, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_15", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_15", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 60, "stop": 64, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_16", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_16", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 64, "stop": 68, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_17", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_17", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 68, "stop": 72, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_18", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_18", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 72, "stop": 76, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_19", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_19", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 76, "stop": 80, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_20", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_20", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 80, "stop": 84, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_21", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_21", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 84, "stop": 88, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_22", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_22", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 88, "stop": 92, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_23", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_23", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 92, "stop": 96, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_24", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_24", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 96, "stop": 100, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_25", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_25", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 100, "stop": 104, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_26", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_26", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 104, "stop": 108, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_27", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_27", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 108, "stop": 112, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_28", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_28", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 112, "stop": 116, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_29", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_29", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 116, "stop": 120, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_30", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_30", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 120, "stop": 124, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_31", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_31", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 124, "stop": 128, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_32", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_32", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 128, "stop": 132, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_33", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_33", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 132, "stop": 136, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_34", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_34", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 136, "stop": 140, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_35", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_35", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 140, "stop": 144, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_36", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_36", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 144, "stop": 148, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_37", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_37", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 148, "stop": 152, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_38", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_38", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 152, "stop": 156, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_39", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_39", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 156, "stop": 160, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_40", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_40", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 160, "stop": 164, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_41", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_41", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 164, "stop": 168, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_42", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_42", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 168, "stop": 172, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_43", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_43", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 172, "stop": 176, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_44", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_44", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 176, "stop": 180, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_45", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_45", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 180, "stop": 184, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_46", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_46", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 184, "stop": 188, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_47", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_47", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 188, "stop": 192, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_48", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_48", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 192, "stop": 196, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_49", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_49", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 196, "stop": 200, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_50", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_50", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 200, "stop": 204, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_51", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_51", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 204, "stop": 208, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_52", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_52", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 208, "stop": 212, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_53", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_53", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 212, "stop": 216, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_54", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_54", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 216, "stop": 220, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_55", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_55", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 220, "stop": 224, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_56", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_56", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 224, "stop": 228, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_57", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_57", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 228, "stop": 232, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_58", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_58", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 232, "stop": 236, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_59", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_59", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 236, "stop": 240, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_60", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_60", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 240, "stop": 244, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_61", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_61", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 244, "stop": 248, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_62", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_62", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": 248, "stop": 252, "step": null}]}]]}, {"class_name": "SlicingOpLambda", "config": {"name": "tf.__operators__.getitem_63", "trainable": true, "dtype": "float32", "function": "__operators__.getitem"}, "name": "tf.__operators__.getitem_63", "inbound_nodes": [["input_layer", 0, 0, {"slice_spec": [{"start": null, "stop": null, "step": null}, {"start": -4, "stop": null, "step": null}]}]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["tf.__operators__.getitem", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1", "inbound_nodes": [[["tf.__operators__.getitem_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_2", "inbound_nodes": [[["tf.__operators__.getitem_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_3", "inbound_nodes": [[["tf.__operators__.getitem_3", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_4", "inbound_nodes": [[["tf.__operators__.getitem_4", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_5", "inbound_nodes": [[["tf.__operators__.getitem_5", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_6", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_6", "inbound_nodes": [[["tf.__operators__.getitem_6", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_7", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_7", "inbound_nodes": [[["tf.__operators__.getitem_7", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_8", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_8", "inbound_nodes": [[["tf.__operators__.getitem_8", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_9", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_9", "inbound_nodes": [[["tf.__operators__.getitem_9", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_10", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_10", "inbound_nodes": [[["tf.__operators__.getitem_10", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_11", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_11", "inbound_nodes": [[["tf.__operators__.getitem_11", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_12", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_12", "inbound_nodes": [[["tf.__operators__.getitem_12", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_13", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_13", "inbound_nodes": [[["tf.__operators__.getitem_13", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_14", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_14", "inbound_nodes": [[["tf.__operators__.getitem_14", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_15", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_15", "inbound_nodes": [[["tf.__operators__.getitem_15", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_16", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_16", "inbound_nodes": [[["tf.__operators__.getitem_16", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_17", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_17", "inbound_nodes": [[["tf.__operators__.getitem_17", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_18", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_18", "inbound_nodes": [[["tf.__operators__.getitem_18", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_19", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_19", "inbound_nodes": [[["tf.__operators__.getitem_19", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_20", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_20", "inbound_nodes": [[["tf.__operators__.getitem_20", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_21", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_21", "inbound_nodes": [[["tf.__operators__.getitem_21", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_22", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_22", "inbound_nodes": [[["tf.__operators__.getitem_22", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_23", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_23", "inbound_nodes": [[["tf.__operators__.getitem_23", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_24", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_24", "inbound_nodes": [[["tf.__operators__.getitem_24", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_25", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_25", "inbound_nodes": [[["tf.__operators__.getitem_25", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_26", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_26", "inbound_nodes": [[["tf.__operators__.getitem_26", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_27", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_27", "inbound_nodes": [[["tf.__operators__.getitem_27", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_28", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_28", "inbound_nodes": [[["tf.__operators__.getitem_28", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_29", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_29", "inbound_nodes": [[["tf.__operators__.getitem_29", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_30", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_30", "inbound_nodes": [[["tf.__operators__.getitem_30", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_31", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_31", "inbound_nodes": [[["tf.__operators__.getitem_31", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_32", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_32", "inbound_nodes": [[["tf.__operators__.getitem_32", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_33", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_33", "inbound_nodes": [[["tf.__operators__.getitem_33", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_34", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_34", "inbound_nodes": [[["tf.__operators__.getitem_34", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_35", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_35", "inbound_nodes": [[["tf.__operators__.getitem_35", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_36", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_36", "inbound_nodes": [[["tf.__operators__.getitem_36", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_37", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_37", "inbound_nodes": [[["tf.__operators__.getitem_37", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_38", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_38", "inbound_nodes": [[["tf.__operators__.getitem_38", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_39", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_39", "inbound_nodes": [[["tf.__operators__.getitem_39", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_40", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_40", "inbound_nodes": [[["tf.__operators__.getitem_40", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_41", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_41", "inbound_nodes": [[["tf.__operators__.getitem_41", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_42", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_42", "inbound_nodes": [[["tf.__operators__.getitem_42", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_43", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_43", "inbound_nodes": [[["tf.__operators__.getitem_43", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_44", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_44", "inbound_nodes": [[["tf.__operators__.getitem_44", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_45", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_45", "inbound_nodes": [[["tf.__operators__.getitem_45", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_46", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_46", "inbound_nodes": [[["tf.__operators__.getitem_46", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_47", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_47", "inbound_nodes": [[["tf.__operators__.getitem_47", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_48", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_48", "inbound_nodes": [[["tf.__operators__.getitem_48", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_49", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_49", "inbound_nodes": [[["tf.__operators__.getitem_49", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_50", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_50", "inbound_nodes": [[["tf.__operators__.getitem_50", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_51", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_51", "inbound_nodes": [[["tf.__operators__.getitem_51", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_52", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_52", "inbound_nodes": [[["tf.__operators__.getitem_52", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_53", "trainable": true, "dtype": "float32", "units": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_53", "inbound_nodes": [[["tf.__operators__.getitem_53", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_54", "trainable": true, 